{
    "android": [

        {
            "name": "Женишбек Кудайкулов",
            "date": "28 февр. 2025 г., 16:34",
            "device": "Samsung Galaxy S21 FE 5G",
            "app": "5.5.1",
            "os": "Android 14 (SDK 34)",
            "grade": 1,
            "text": "Последний время глючит не возможно работать поправьте."
        },
                        
        {
            "name": "Игорь Алексеевич",
            "date": "26 февр. 2025 г., 20:36",
            "device": "Tecno CAMON 20 Pro",
            "app": "5.5.1",
            "os": "Android 14 (SDK 34)",
            "grade": 2,
            "text": "За годы работы приложение стало заметно лучше работать, особенно на телефоне с нормальной оперативкой, слабые конечно не тянут ) А что касается навигации и локации, так это не проблема вкусвила, а системы пво нашей страны. Р.С. Отвратительно сейчас работает "
        },
        {
            "name": "Камал Джалалиев",
            "date": "26 февр. 2025 г., 08:30",
            "device": "Tecno",
            "app": "5.5.1",
            "os": "Android 13 (SDK 33)",
            "grade": 1,
            "text": "Ооочень сильно тупит не возможно работать!!!"
        },
        {
            "name": "Александр Панфилов",
            "date": "21 февр. 2025 г., 16:48",
            "device": "POCO F5",
            "app": "5.5.1",
            "os": "Android 14 (SDK 34)",
            "grade": 4,
            "text": "здравствуйте, после последней обновы приложение реально стало быстрее, плавнее и всё такое, но пропали полезные функции и стали подлагивать старые; при перемещении из 'сборки' в 'доставку' карта города долго и с лагами прогружается, из 'очереди' теперь нельзя выйти в другой раздел (это было полезно), очень стала тормозить и перезагружаться оплата tap on phone; оффлайн режим не работает) хотелось бы, чтобы при оплате tap on phone генерировался QR код, по которому клиент может оплатить заказ,"
        },
        {
            "name": "Илья Казаков",
            "date": "16 февр. 2025 г., 21:35",
            "device": "Xiaomi Mi A1",
            "app": "5.5.1",
            "os": "Android 9 (SDK 28)",
            "grade": 1,
            "text": "Почему не открывается приложение Какие могут быть причины На одном телефоне открывпется на другом нет Дркгой андроид 9 ?"
        },
        {
            "name": "Osaki Nana",
            "date": "14 февр. 2025 г., 08:21",
            "device": "Redmi Note 13",
            "app": "5.5.0",
            "os": "Android 15 (SDK 35)",
            "grade": 5,
            "text": "Долго запускается. Бывает виснет в целом работать можно"
        },        
        {
            "name": "Вячеслав Куйдин",
            "date": "8 февр. 2025 г., 00:33",
            "device": "Vivo iQOO Z9 Turbo",
            "app": "5.3.0",
            "os": "Android 14 (SDK 34)",
            "grade": 1,
            "text": "С каждым обновлением лагает ещё больше. Очень долго грузит и да это не из за плохого инета или старого телефона всего этого у меня нет. Все дело в самой проге, решайте это инече это не работа"
        },         
        {
            "name": "близнец июньский",
            "date": "7 февр. 2025 г., 19:42",
            "device": "Honor HONOR X6",
            "app": "5.3.0",
            "os": "Android 14 (SDK 34)",
            "grade": 1,
            "text": "Не могу войти в приложение. Не приходит смс. Выкинуло сегодня, весь день приложение тормозило. Сейчас не могу войти."
        },          
        {
            "name": "Sergio",
            "date": "7 февр. 2025 г., 09:30",
            "device": "Redmi A1+",
            "app": "5.3.0",
            "os": "Android 12 (SDK 31)",
            "grade": 1,
            "text": "После обновления стало очень часто виснуть приложение,а так же никак не могут сделать что бы приложение закрывало заказы без интернета, учитывая плохое качество связи в подъездах домов и так же тормозную систему андроид , постоянно возникают проблемы с закрытием, добавляю отзыв, как было раньше плохо так стало ещё хуже, по существу ну не могут сделать приложение для нормальной работы, с этим надо жить"
        },  
        {
            "name": "Роман Иванов",
            "date": "3 февр. 2025 г., 10:42",
            "device": "POCO X3 Pro",
            "app": "5.3.0",
            "os": "Android 12 (SDK 31)",
            "grade": 1,
            "text": "С каждым обновлением всё хуже и хуже🤢🤢🤮🤮🤮🤮 Приложение лагает жёстко, постоянно приходится выходить и заново входить в приложение. Вечные проблемы с закрытием заказов, может по несколько минут думать, а потом выдать: 'произошла ошибка закрытия заказа', когда время заказа уже в минусе. Оффлайн режим никак не могут сделать адекватным, чтобы закрыть заказ в лифте и забыть о нём. За последний год приложение только испортили, вам нужно менять своих 'разработчиков', видимо их по знакомству взяли."
        },        
        {
            "name": "smit052704",
            "date": "25 янв. 2025 г., 11:30",
            "device": "Redmi Note 9",
            "app": "",
            "os": "Android 11 (SDK 30)",
            "grade": 1,
            "text": "всё что обещают в рекламах в даной компании это обман, не ведитесь, чтоб заработать от 5500 вам надо работать не меньше 15 часов на ногах, средняя ценна доставки 117-138 за заказ растояние не маленькие в день спокойно вы можете проехать 200-300 км заработая 4000-4500, уважание от покупателей нет уважения от куратора тем более, вы для этой компании расходный материал, если вы хотите быть рабом без собственного мнения терпеть унижение и оскорбление со всех сторон то добро пожаловать"
        },
        {
            "name": "Episode Play",
            "date": "18 янв. 2025 г., 11:59",
            "device": "Infinix NOTE 30i",
            "app": "",
            "os": "Android 13 (SDK 33)",
            "grade": 5,
            "text": "Платят деньги, работы много"
        },
        {
            "name": "Пользователь Google Play",
            "date": "18 янв. 2025 г., 06:40",
            "device": "Samsung Galaxy A16",
            "app": "",
            "os": "Android 14 (SDK 34)",
            "grade": 1,
            "text": "Не идите!"
        },        
        {
            "name": "Leo Leo",
            "date": "5 янв. 2025 г., 19:58",
            "device": "Radger Redmi 10C",
            "app": "",
            "os": "Android 13 (SDK 33)",
            "grade": 1,
            "text": "На qin2 pro не открывается"
        },
        {
            "name": "Abuzarr Худоеров",
            "date": "31 дек. 2024 г., 09:24",
            "device": "POCO F5",
            "app": "",
            "os": "Android 14 (SDK 34)",
            "grade": 1,
            "text": "Каждый день 1 новшество и новые проблемы теперь я не вижу карты что где собирают чтобы ориентироваться"
        },
        {
            "name": "Каримов Джавохир",
            "date": "18 дек. 2024 г., 22:01",
            "device": "POCO F5",
            "app": "5.3.0",
            "os": "Android 9 (SDK 28)",
            "grade": 5,
            "text": " Вкуссвил супер"
        },
        {
            "name": "Владимир Великий",
            "date": "10 дек. 2024 г., 16:53",
            "device": "realme 真我13 Pro",
            "app": "5.0.0",
            "os": "AAndroid 14 (SDK 34)",
            "grade": 1,
            "text": "Минусы последних обнов: 1) тупит (при закрытии нажимаешь не реагирует, сработать может через 5 -10 сек а может и нет) 2) почему курьеру засчитывается просрок когда он вовремя отдает заказ но по техническим причинам не может закрыть его вовремя (нет связи в регионах, по всем давно понятным причинам) Сделайте выключение таймера и закрытие заказа в режиме оффлайн ВЫ уже, УВАЖАЕМЫЕ РАЗРАБОТЧИКИ, УСЛЫШЬТЕ РАБОТЯГ!"
        },
        {
            "name": "Умед Конунов",
            "date": "6 дек. 2024 г., 19:38",
            "device": "realme 真我13 Pro",
            "app": "5.0.0",
            "os": "AAndroid 14 (SDK 34)",
            "grade": 1,
            "text": "💩"
        },        
        {
            "name": "Jack",
            "date": "3 дек. 2024 г., 23:56",
            "device": "realme 真我13 Pro",
            "app": "5.0.0",
            "os": "Android 13 (SDK 33)",
            "grade": 1,
            "text": "Исправьте пожалуйста, после обновления очень плохо 👎 работает!!!3.12.24"
        },        
        {
            "name": "Евгений Ерешко",
            "date": "28 нояб. 2024 г., 16:29",
            "device": "realme 真我13 Pro",
            "app": "5.0.0",
            "os": "Android 11 (SDK 30)",
            "grade": 5,
            "text": "изменил отзыв проблему решили спасибо (приложение тупит уже 2 неделю заказы в статусе сборка не вижу, в доступные попадают с опозданием, оповещения приходят через раз исправьте пожалуйста)"
        }          
                
            

    ],
    "ios": [ 
        
    
        {
            "name": "Shonshelbi",
            "date": "24 фев. 2025 г.",
            "device": "",
            "app": "5.3.0",
            "os": "",
            "grade": 1,
            "text": "Сделайте пожалуйста работу приложения лучше. Пожалуйста постарайтесь. Пожалуйста! Потому что приложение работает ужасно. Я как курьер вам об этом говорю."
        }, 
        {
            "name": "Judoka2211",
            "date": "13 фев. 2025 г.",
            "device": "",
            "app": "5.3.0",
            "os": "",
            "grade": 1,
            "text": "Очень сильно лагает после обновления. Сделайте нормальную приложению, а то сильно начал лагать после обновления."
        },        
        {
            "name": "вгшдсвшдиябжзбыа",
            "date": "13 фев. 2025 г.",
            "device": "",
            "app": "5.3.0",
            "os": "",
            "grade": 3,
            "text": "Игнорирование проблемы. Не понимаю почему никто не обращает внимание на эту проблему. Когда на одном адресе несколько заказов 2,3,4 и т.д. на карте отображается одна точка и кажется что там только один заказ. И постоянно происходят такие ситуации когда курьеры беру один заказ и уезжают, оставляя следующие заказы на данный адрес. А решение очень простое, необходимо немного разнести точки отображения что бы курьеры видели сколько заказов на этом адресе.",
            "info": true
        },     
        {
            "name": "Аноним95995",
            "date": "4 фев. 2025 г.",
            "device": "",
            "app": "5.3.0",
            "os": "",
            "grade": 1,
            "text": "Лагает. После обновления , приложение сильно лагает."
        },
        {
            "name": "Ро-рома",
            "date": "4 фев. 2025 г.",
            "device": "",
            "app": "5.3.0",
            "os": "",
            "grade": 3,
            "text": "Предложение. Добрый день. Сделайте, пожалуйста, возможность смотреть доход за неделю с пн по вс и за месяц с 1 по 31 число.",
            "info": true
        },
        {
            "name": "pseudopsyxo",
            "date": "2 фев. 2025 г.",
            "device": "",
            "app": "5.3.0",
            "os": "",
            "grade": 3,
            "text": "Немного удобства для работяг. Прошу присвоить каждому курьеру в очереди свой цвет и отображать на карте доступных кто где заказы берет, мы снимем обязанности с кураторов и наладим контакт в команде, чтобы каждый набирался в своем районе и видел кто где набирается в других. Также хочу отметить то насколько это важно, в отиличие от проверки пакетов, какая глупость! ведь какая мне разница до того на какой полке они лежали, главное то сколько по количеству у меня их в руке!",
            "info": true
        },
        {
            "name": "@normans",
            "date": "21 янв. 2025 г.",
            "device": "",
            "app": "5.3.0",
            "os": "",
            "grade": 5,
            "text": "Крайнее обновление очень порадовало. С каждым обновлением все лучше и лучше."
        },
        {
            "name": "Кирилл климкин",
            "date": "15 янв. 2025 г.",
            "device": "",
            "app": "5.0.0",
            "os": "",
            "grade": 3,
            "text": "Добавьте рейтинг клиента. Очень надо, и за низкий блокировать."
        },
        {
            "name": "Afench0352",
            "date": "14 янв. 2025 г.",
            "device": "",
            "app": "5.0.0",
            "os": "",
            "grade": 2,
            "text": "Кривое.  Кривее приложения так просто не найдешь У одних работает счетчик заказов за день у других нет, у кого то можно сразу вернуть заказ у других нет, полный рандом."
        },        
        {
            "name": "VMApro",
            "date": "11 янв. 2025 г.",
            "device": "",
            "app": "5.0.0",
            "os": "",
            "grade": 2,
            "text": "Сделайте свайп назад, я вас умоляю! За смену по 1000 раз приходится попадать в маленькую стрелочку. Простейшая в реализации функция, но без нее больно работать 🫨 Стандартная функция приложений в iOS - свайп от левого края для перехода назад, чтобы каждый раз не тянуться в верхний левый угол, чтобы нажать на стрелочку.",
            "info": true           
        },        
        {
            "name": "Smurfochka 55",
            "date": "11 янв. 2025 г.",
            "device": "",
            "app": "5.0.0",
            "os": "",
            "grade": 4,
            "text": "Предложения по работе программы. 1. Очень не хватает кнопки «доставил лично» при указании «оставить у двери», так как достаточно часто люди уже ждут с открытой дверью. 2. Очень важно! Есть дома - вход/въезд в которые - отдельный квест( Мало того, что платишь за парковку, и тащишь тяжелые сумки через весь двор, так ещё и теряется ОЧЕНЬ много времени на это. Можно ли добавить в приложении запрос, есть ли шлагбаум на въезд, и если он в доме есть, обязательно, а не опционально, добавлять кнопку «открыть шлагбаум»?",
            "info": true
        },        

        {
            "name": "Курьер7775",
            "date": "20 дек. 2024 г.",
            "device": "",
            "app": "5.0.0",
            "os": "",
            "grade": 3,
            "text": "Здравствуйте! Хотелось бы увидеть следующие пожелания! 1. Добавить значок яйца, когда в заказе есть яица. Как это сделано у воды 5л. 2. Не показывает значок воды, когда в заказе есть вода 1.5 л. Добавьте пожалуйста! 3. Предлагаю сделать рейтинг клиента. Что бы курьеры могли оценивать клиентов. Бывают разные клиенты. 4. Добавить правило, если домофон не работает/консьержа нет, что клиенту необходимо предоставить беспрепятственный доступ в подъезд. Для доставки заказа( спуститься за заказом заранее, если доступно управление с телефона домофоном, открыть так) 5. Предлагаю заказ в сервисе экспресс, на карте отмечать другим цветом."
        },
        {
            "name": "VMApro",
            "date": "13 дек. 2024 г.",
            "device": "",
            "app": "5.0.0",
            "os": "",
            "grade": 4,
            "text": "Сделайте свайп назад Стандартная функция приложений в iOS - свайп от левого края для перехода назад, чтобы каждый раз не тянуться в верхний левый угол, чтобы нажать на стрелочку."
        },
        {
            "name": "Divizion",
            "date": "5 дек. 2024 г.",
            "device": "",
            "app": "5.0.0",
            "os": "",
            "grade": 3,
            "text": "Исправьте Не получается посмотреть дневной заработок, показывать только за 3 дня"
        },        
        {
            "name": "ИсламO7",
            "date": "29 нояб. 2024 г.",
            "device": "",
            "app": "5.0.0",
            "os": "",
            "grade": 4,
            "text": "Просроки Здравствуйте! Все обновления устраивает все хорошо, лучшая компания с лучшими выплатами, до 5 звезды не дотягивает из за просроков, сделайте пожалуйста что после завершения заказа, клиенту не приходило уведомление хотя бы минуты 3, потому что за улице поляны в башнях вообще никакая сеть не ловит абсолютно, и приходится закрыть заказ на улице а пока поднимешься клиент пишет жалобу что закрыл заказа заранее за что ругают кураторы, прошу заметить"
        },
        {
            "name": "teimyraz777",
            "date": "28 нояб. 2024 г.",
            "device": "",
            "app": "5.0.0",
            "os": "",
            "grade": 1,
            "text": "В архиве после обновления невозможно посмотреть сколько ты сделал заказов именно за то число , которое тебе нужно, вот например за сегодня мне пришлось считать как раньше… смысл обновления…"
        }, 
        {
            "name": "P8F1STiK",
            "date": "28 нояб. 2024 г.",
            "device": "",
            "app": "5.0.0",
            "os": "",
            "grade": 5,
            "text": "Может спустя 2 года сделаете оценка клиента?)"
        }
    ],    
    "rustore": [
        
        {
            "name": "Вячеслав",
            "date": "18.02.2025",
            "device": "Xiaomi M2101K6G",
            "app": "5.0.0",
            "os": "",
            "grade": 5,
            "text": "Для автомобильных ГУ можно как то сделать? Скачал на головное устройство, но оно не открывает даже",
            "info": true
        },         
        {
            "name": "Сергей",
            "date": "7.02.2025",
            "device": "HUAWEI VOG-L29",
            "app": "5.0.0",
            "os": "",
            "grade": 4,
            "text": "Поставлю 4. Вот что нужно точно доработать: изменение цвета отсканированного места в полученном заказе, например, на зелёный. То есть, получил заказ, отсканировал место и цвет плашки с указанием стеллажа изменился на зелёный. Вот это будет топ .",
            "info": true
        }, 
        {
            "name": "Василий",
            "date": "04.02.2025",
            "device": "vivo V2237",
            "app": "5.0.0",
            "os": "",
            "grade": 2,
            "text": "Интерфейс выглядит отвратительно будто его не обновляли с времён динозавров, а так в целом функционально"
        }, 
        {
            "name": "Олег",
            "date": "26.01.2025",
            "device": "HHUAWEI YAL-L21",
            "app": "5.0.0",
            "os": "",
            "grade": 5,
            "text": "Всё хорошо"
        },        
            {
                "name": "Владимир",
                "date": "20.11.2024",
                "device": "HONOR RMO-NX1",
                "app": "5.0.0",
                "os": "",
                "grade": 5,
                "text": "все отлично!!!"
            },
            {
                "name": "Алексей",
                "date": "16.10.2024",
                "device": "vivo V2036",
                "app": "5.0.0",
                "os": "",
                "grade": 5,
                "text": "Здравствуйте,сделайте пожалуйста в разделе завершение заказа оплату по кьюар-коду.",
                "info": true
            },           
            {
                "name": "Ahmad",
                "date": "15.10.2024",
                "device": "samsung SM-A556E",
                "app": "5.0.0",
                "os": "",
                "grade": 3,
                "text": "Не открывает на galaxy a55"
            },
            {
                "name": "Гиперион",
                "date": "02.08.2024",
                "device": "vivo V2201",
                "app": "5.0.0",
                "os": "",
                "grade": 1,
                "text": "установил приложение.зарегистрировался.код не приходит!войти не могу!!при повторной регистрации пишет что такой пользователь уже зарегистрирован!!!"
            },           
            {
                "name": "Алексей",
                "date": "11.06.2024",
                "device": "HUAWEI VOG-L29",
                "app": "5.0.0",
                "os": "",
                "grade": 3,
                "text": "Верните доступ к шлакбаума. Сделайте возможность курьерам писать комментарии к адресам."
            }
    ]

} 

